In [2]:
#1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [3]:
import pandas as pd

In [4]:
ds =pd.Series([2, 4, 6, 8, 10])
print(ds)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [ ]:
#2. Write a Pandas program to convert a Panda module Series to Python list and it’s type.

In [ ]:
import pandas as pd

In [5]:
ds = pd.Series([2, 4, 6, 8, 10])
print("Pandas Series and type")
print(ds)
print(type(ds))
print(type(ds))
print("Convrt Pandas Series to Python list")
print(ds.tolist())
print(type(ds.tolist()))

Pandas Series and type
0     2
1     4
2     6
3     8
4    10
dtype: int64
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
Convrt Pandas Series to Python list
[2, 4, 6, 8, 10]
<class 'list'>

In [ ]:
#3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
   Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [6]:
import pandas as pd

In [7]:
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)

Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [8]:
#4. Write a Pandas program to convert a dictionary to a Pandas series.

In [9]:
import pandas as pd

In [10]:
d1 = {'a': 100, 'b': 200, 'c':300, 'd':400, 'e':800}
print("Original dictionary:")
print(d1)
new_series = pd.Series(d1)
print("Converted series:")
print(new_series)

Original dictionary:
{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
Converted series:
a    100
b    200
c    300
d    400
e    800
dtype: int64

In [1]:
#5. Write a Pandas program to convert a NumPy array to a Pandas series.

In [2]:
import numpy as np
import pandas as pd

In [4]:
np_array = np.array([15, 25, 35, 45, 55])
print("NumPy array:")
print(np_array)
new_series = pd.Series(np_array)
print("Converted Pandas series:")
print(new_series)

NumPy array:
[15 25 35 45 55]
Converted Pandas series:
0    15
1    25
2    35
3    45
4    55
dtype: int64

In [5]:
#6. Write a Pandas program to change the data type of given a column or a Series.

In [6]:
import pandas as pd

In [7]:
s1 = pd.Series(['200', '300', 'python', '400.18', '500'])
print("Original Data Series:")
print(s1)
print("Change the said data type to numeric:")
s2 = pd.to_numeric(s1, errors='coerce')
print(s2)

Original Data Series:
0       200
1       300
2    python
3    400.18
4       500
dtype: object
Change the said data type to numeric:
0    200.00
1    300.00
2       NaN
3    400.18
4    500.00
dtype: float64

In [8]:
#7. Write a Pandas program to convert a given Series to an array.

In [9]:
import pandas as pd
import numpy as np

In [10]:
s1 = pd.Series(['10', '20', 'python', '30.12', '40'])
print("Original Data Series:")
print(s1)
print("Series to an array")
a = s1.values
print(a)
print(type(a))

Original Data Series:
0        10
1        20
2    python
3     30.12
4        40
dtype: object
Series to an array
['10' '20' 'python' '30.12' '40']
<class 'numpy.ndarray'>

In [11]:
#8. Write a Pandas program to create a dataframe from a dictionary and display it.

In [12]:
import pandas as pd

In [14]:
df = pd.DataFrame({'X':[11,12,13,14,15], 'Y':[21,22,23,24,25],'Z':[31,32,33,34,35]});
print(df)

    X   Y   Z
0  11  21  31
1  12  22  32
2  13  23  33
3  14  24  34
4  15  25  35

In [17]:
#11. Refer the dataset "Advertising.csv" and perform following tasks.
#i) Read the dataset "Advertising.csv" in data frame.
#ii) Print first five records of dataset.
#iii) print last five records from dataset.
#iv) display the columns inside the dataset.
#v) display last three records from dataset.
#vi) display the information about the dataset and analyse the data.
#vii) display types of each columns.
#viii) check for null values in the dataset and display the sum of null values inside the column.
#ix) drop a column 'radio' from a dataset and display first ten records.
#x) increase the sales by 10% and add a new column "updated_sales" in dataframe.
#xi) display shape of data.
#xii) Find out maximum,minimum,mean,median,standard deviation value of each column.
#xiii) describe the dataset.

In [18]:
import pandas as pd

In [21]:
df = pd.read_csv('./Advertising.csv')

In [49]:
print(df)#i) Read the dataset "Advertising.csv" in data frame.

        TV  radio  newspaper  sales  updated_sales
0    230.1   37.8       69.2   22.1           2.21
1     44.5   39.3       45.1   10.4           1.04
2     17.2   45.9       69.3    9.3           0.93
3    151.5   41.3       58.5   18.5           1.85
4    180.8   10.8       58.4   12.9           1.29
..     ...    ...        ...    ...            ...
195   38.2    3.7       13.8    7.6           0.76
196   94.2    4.9        8.1    9.7           0.97
197  177.0    9.3        6.4   12.8           1.28
198  283.6   42.0       66.2   25.5           2.55
199  232.1    8.6        8.7   13.4           1.34

[200 rows x 5 columns]

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [25]:
df.tail() # last five records

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [26]:
df.tail() # last five records

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [27]:
print(df.columns)

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [28]:
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [30]:
# print the statistical information
df.describe()

               TV       radio   newspaper       sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [31]:
#checking null values
df.isna().sum()

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [32]:
#ix) drop a column 'radio' from a dataset and display first ten records.

In [34]:
df.drop(['radio'],axis=1)

        TV  newspaper  sales
0    230.1       69.2   22.1
1     44.5       45.1   10.4
2     17.2       69.3    9.3
3    151.5       58.5   18.5
4    180.8       58.4   12.9
..     ...        ...    ...
195   38.2       13.8    7.6
196   94.2        8.1    9.7
197  177.0        6.4   12.8
198  283.6       66.2   25.5
199  232.1        8.7   13.4

[200 rows x 3 columns]

In [36]:
#x) increase the sales by 10% and add a new column "updated_sales" in dataframe.

In [38]:
df['updated_sales'] = df['sales'] * 0.10

In [39]:
df.head()

      TV  radio  newspaper  sales  updated_sales
0  230.1   37.8       69.2   22.1           2.21
1   44.5   39.3       45.1   10.4           1.04
2   17.2   45.9       69.3    9.3           0.93
3  151.5   41.3       58.5   18.5           1.85
4  180.8   10.8       58.4   12.9           1.29

In [41]:
#xi) display shape of data.

In [42]:
import pandas as pd

In [48]:
data = pd.read_csv("Advertising.csv")
 
# dataframe.size
size = data.size
 
# printing size 
print("Size = {}".format(size))

Size = 800

In [ ]:
#xii) Find out maximum,minimum,mean,median,standard deviation value of each column.

In [50]:
#xiii) describe the dataset.

In [51]:
df.describe()

               TV       radio   newspaper       sales  updated_sales
count  200.000000  200.000000  200.000000  200.000000     200.000000
mean   147.042500   23.264000   30.554000   14.022500       1.402250
std     85.854236   14.846809   21.778621    5.217457       0.521746
min      0.700000    0.000000    0.300000    1.600000       0.160000
25%     74.375000    9.975000   12.750000   10.375000       1.037500
50%    149.750000   22.900000   25.750000   12.900000       1.290000
75%    218.825000   36.525000   45.100000   17.400000       1.740000
max    296.400000   49.600000  114.000000   27.000000       2.700000

In [ ]:
#12. Refer the dataset "Salaries.csv" and perform following tasks.
#i) Read the dataset in dataframe.
#ii) display first five records.
#iii) display first ten records.
#iv) display last five records.
#v) display last ten records.
#vi) display the columns inside the dataset.
#vii) display shape of data.
#viii) describe the dataset.
#ix) display the information about the dataset and analyse the data.
#x) display types of each columns.
#xi) Find out maximum,minimum,mean,median,standard deviation value of each column.

In [52]:
import pandas as pd

In [53]:
df = pd.read_csv('./Salary_Data.csv')

In [54]:
print(df)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [55]:
#ii) display first five records.

In [56]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [57]:
#iii) display first ten records.

In [58]:
df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [60]:
#iv) display last five records.

In [61]:
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [62]:
#v) display last ten records.

In [63]:
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [64]:
#vi) display the columns inside the dataset.

In [65]:
print(df.columns)

Index(['YearsExperience', 'Salary'], dtype='object')

In [66]:
#vii) display shape of data.

In [67]:
import pandas as pd

In [68]:
data = pd.read_csv("Salary_Data.csv")
 
# dataframe.size
size = data.size
 
# printing size 
print("Size = {}".format(size))

Size = 66

In [70]:
#viii) describe the dataset.

In [71]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [ ]:
#ix) display the information about the dataset and analyse the data.

In [74]:
df.info  #x) display types of each columns.

<bound method DataFrame.info of     YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000>